{
  "content": "# Ankush Singh\n\n+917300169695 — ankushsingh.dev@gmail.com — linkedin.com/in/whyankush07 — github.com/ankush-web-eng\n\n# Summary\n\nSoftware Engineer skilled in Go, Next.js, and TypeScript, with experience in compiler design, distributed systems, and real-time applications. Passionate about performance and user-focused solutions.\n\n# Skills\n\n- Golang, TypeScript, Python\n- Docker, Kubernetes, CI/CD, AWS\n- React, Next.js, Express.js, Node.js\n- gRPC, RestAPI, GIT, GitHub, BitBucket\n- MongoDB, PostgreSQL, Redis, Kafka\n\n# Projects\n\n# Brolang - A fun programming language\n\n- Developed a compiler for a custom programming language, focusing on parsing, lexical analysis, and code evaluation.\n- Integrated support for loops, conditionals, arrays, and arithmetic operations, ensuring efficient execution and seamless error handling.\n- Event-based architecture to design and implement real-time feedback and distributed processing capabilities using Kafka, Redis, and WebSocket.\n\n# Sudodev - Mini Backend-as-a-Service (BaaS)\n\n- Built a high-concurrency backend in Go, leveraging goroutines, channels, and asynchronous programming.\n- Designed a frontend with Next.js and modern UI libraries to provide a user-friendly interface.\n- Developed secure API key management, allowing clients to send emails and upload images to Cloudinary without additional libraries, simplifying integrations with just API calls.\n\n# Chatsia - Real-Time Chat and Video Call Application\n\n- Developed a chat application with real-time messaging and video call functionality, ensuring seamless user interactions.\n- Integrated robust messaging protocols using WebSockets and WebRTC for reliable video calls, focusing on performance and low-latency communication.\n- Emphasized user experience with a responsive design and secure communication features.\n\n# Education\n\nGLA University\n\nBachelor of Technology in Computer Science and Engineering\n\nCPI: 8.02\n\n# Experience\n\n# Full Stack Developer Intern - LegaByte Innovations\n\nMay - June 2024, Remote\n\n- Collaborated with a team to build final product under CTO guidance, improving data transfer speed by 25% with a FastAPI-powered API Gateway.\n- Containerized APIs with Docker, deployed on Azure Kubernetes, enhancing system reliability.\n- Built 15+ Next.js components using UI libraries like Shadcn-UI and Material-UI, boosting development efficiency by 30%.\n\n# Next.js Developer Intern - Vistaran Technotrix Pvt. Ltd.\n\nJuly 2024, Remote\n\n- Optimized code to improve SEO by 30% and reduce load time by 20%, resulting in a 15% increase in organic traffic.\n- Enhanced Next.js and React performance, delivering a seamless user experience with efficient code structure.\n\n# Achievements\n\n- Solved 100+ problems on Data Structures and Algorithms on Leetcode and Geeks-for-Geeks.",
  "metadata": {
    "file_path": "C:\\Users\\lovek\\AppData\\Local\\Temp\\llama-boLp4X\\temp-file",
    "file_name": "temp-file"
  }
}